OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18313.h
extern __at(0x0013) __sfr PIR3;

typedef struct
  {
  unsigned CLC1IF               : 1;
  unsigned CLC2IF               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned CSWIF                : 1;
  unsigned OSFIF                : 1;
  } __PIR3bits_t;

extern __at(0x0013) volatile __PIR3bits_t PIR3bits;

#define _CLC1IF                 0x01
#define _CLC2IF                 0x02
#define _CSWIF                  0x40
#define _OSFIF                  0x80

//==============================================================================


//==============================================================================
//        PIR4 Bits

extern __at(0x0014) __sfr PIR4;

typedef struct
  {
  unsigned CCP1IF               : 1;
  unsigned CCP2IF               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned CWG1IF               : 1;
  unsigned                      : 1;
  } __PIR4bits_t;

extern __at(0x0014) volatile __PIR4bits_t PIR4bits;

#define _CCP1IF                 0x01
#define _CCP2IF                 0x02
#define _CWG1IF                 0x40

//==============================================================================


//==============================================================================
//        TMR0L Bits

extern __at(0x0015) __sfr TMR0L;

typedef struct
  {
  unsigned TMR00                : 1;
  unsigned TMR01                : 1;
  unsigned TMR02                : 1;
  unsigned TMR03                : 1;
  unsigned TMR04                : 1;
  unsigned TMR05                : 1;
  unsigned TMR06                : 1;
  unsigned TMR07                : 1;
  } __TMR0Lbits_t;

extern __at(0x0015) volatile __TMR0Lbits_t TMR0Lbits;

#define _TMR00                  0x01
#define _TMR01                  0x02
#define _TMR02                  0x04
#define _TMR03                  0x08
#define _TMR04                  0x10
#define _TMR05                  0x20
#define _TMR06                  0x40
#define _TMR07                  0x80

//==============================================================================


//==============================================================================
//        TMR0H Bits

extern __at(0x0016) __sfr TMR0H;

typedef struct
  {
  unsigned TMR08                : 1;
  unsigned TMR09                : 1;
  unsigned TMR010               : 1;
  unsigned TMR011               : 1;
  unsigned TMR012               : 1;
  unsigned TMR013               : 1;
  unsigned TMR014               : 1;
  unsigned TMR015               : 1;
  } __TMR0Hbits_t;

extern __at(0x0016) volatile __TMR0Hbits_t TMR0Hbits;

#define _TMR08                  0x01
#define _TMR09                  0x02
#define _TMR010                 0x04
#define _TMR011                 0x08
#define _TMR012                 0x10
#define _TMR013                 0x20
#define _TMR014                 0x40
#define _TMR015                 0x80

//==============================================================================


//==============================================================================
//        T0CON0 Bits

extern __at(0x0017) __sfr T0CON0;

typedef union
  {
  struct
    {
    unsigned T0OUTPS0           : 1;
    unsigned T0OUTPS1           : 1;
    unsigned T0OUTPS2           : 1;
    unsigned T0OUTPS3           : 1;
    unsigned T016BIT            : 1;
    unsigned T0OUT              : 1;
    unsigned                    : 1;
    unsigned T0EN               : 1;
    };

  struct
    {
    unsigned T0OUTPS            : 4;
    unsigned                    : 4;
    };
  } __T0CON0bits_t;

extern __at(0x0017) volatile __T0CON0bits_t T0CON0bits;

#define _T0OUTPS0               0x01
#define _T0OUTPS1               0x02
#define _T0OUTPS2               0x04
#define _T0OUTPS3               0x08
#define _T016BIT                0x10
#define _T0OUT                  0x20
#define _T0EN                   0x80

//==============================================================================


//==============================================================================
//        T0CON1 Bits

extern __at(0x0018) __sfr T0CON1;

typedef union
  {
  struct
    {
    unsigned T0CKPS0            : 1;
    unsigned T0CKPS1            : 1;
    unsigned T0CKPS2            : 1;
    unsigned T0CKPS3            : 1;
    unsigned T0ASYNC            : 1;
    unsigned T0CS0              : 1;
    unsigned T0CS1              : 1;
    unsigned T0CS2              : 1;
    };

  struct
    {
    unsigned T0CKPS             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 5;
    unsigned T0CS               : 3;
    };
  } __T0CON1bits_t;

extern __at(0x0018) volatile __T0CON1bits_t T0CON1bits;

#define _T0CKPS0                0x01
#define _T0CKPS1                0x02
#define _T0CKPS2                0x04
#define _T0CKPS3                0x08
#define _T0ASYNC                0x10
#define _T0CS0                  0x20
#define _T0CS1                  0x40
#define _T0CS2                  0x80

//==============================================================================

extern __at(0x0019) __sfr TMR1;
extern __at(0x0019) __sfr TMR1L;
extern __at(0x001A) __sfr TMR1H;

//==============================================================================
//        T1CON Bits

extern __at(0x001B) __sfr T1CON;

typedef union
  {
  struct
    {
    unsigned TMR1ON             : 1;
    unsigned                    : 1;
    unsigned T1SYNC             : 1;
    unsigned T1SOSC             : 1;
    unsigned T1CKPS0            : 1;
    unsigned T1CKPS1            : 1;
    unsigned TMR1CS0            : 1;
    unsigned TMR1CS1            : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned T1CKPS             : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned TMR1CS             : 2;
    };
  } __T1CONbits_t;

