OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18313.h
//----------------------------- CONFIG3 Options -------------------------------

#define _WRT_ALL                0x3FFC  // 0000h to 07FFh write protected, no addresses may be modified.
#define _WRT_HALF               0x3FFD  // 0000h to 03FFh write-protected, 0400h to 07FFh may be modified.
#define _WRT_BOOT               0x3FFE  // 0000h to 01FFh write-protected, 0200h to 07FFh may be modified.
#define _WRT_OFF                0x3FFF  // Write protection off.
#define _LVP_OFF                0x1FFF  // HV on MCLR/VPP must be used for programming.
#define _LVP_ON                 0x3FFF  // Low voltage programming enabled. MCLR/VPP pin function is MCLR. MCLRE configuration bit is ignored.

//----------------------------- CONFIG4 Options -------------------------------

#define _CP_ON                  0x3FFE  // User NVM code protection enabled.
#define _CP_OFF                 0x3FFF  // User NVM code protection disabled.
#define _CPD_ON                 0x3FFD  // Data NVM code protection enabled.
#define _CPD_OFF                0x3FFF  // Data NVM code protection disabled.

//==============================================================================

#define _DEVID1                 0x8006

#define _IDLOC0                 0x8000
#define _IDLOC1                 0x8001
#define _IDLOC2                 0x8002
#define _IDLOC3                 0x8003

//==============================================================================

#ifndef NO_BIT_DEFINES

#define ADACT0                  ADACTbits.ADACT0                // bit 0
#define ADACT1                  ADACTbits.ADACT1                // bit 1
#define ADACT2                  ADACTbits.ADACT2                // bit 2
#define ADACT3                  ADACTbits.ADACT3                // bit 3

#define ADON                    ADCON0bits.ADON                 // bit 0
#define GO_NOT_DONE             ADCON0bits.GO_NOT_DONE          // bit 1, shadows bit in ADCON0bits
#define ADGO                    ADCON0bits.ADGO                 // bit 1, shadows bit in ADCON0bits
#define GO                      ADCON0bits.GO                   // bit 1, shadows bit in ADCON0bits
#define CHS0                    ADCON0bits.CHS0                 // bit 2
#define CHS1                    ADCON0bits.CHS1                 // bit 3
#define CHS2                    ADCON0bits.CHS2                 // bit 4
#define CHS3                    ADCON0bits.CHS3                 // bit 5
#define CHS4                    ADCON0bits.CHS4                 // bit 6
#define CHS5                    ADCON0bits.CHS5                 // bit 7

#define ADPREF0                 ADCON1bits.ADPREF0              // bit 0
#define ADPREF1                 ADCON1bits.ADPREF1              // bit 1
#define ADNREF                  ADCON1bits.ADNREF               // bit 2
#define ADCS0                   ADCON1bits.ADCS0                // bit 4
#define ADCS1                   ADCON1bits.ADCS1                // bit 5
#define ADCS2                   ADCON1bits.ADCS2                // bit 6
#define ADFM                    ADCON1bits.ADFM                 // bit 7

#define ANSA0                   ANSELAbits.ANSA0                // bit 0
#define ANSA1                   ANSELAbits.ANSA1                // bit 1
#define ANSA2                   ANSELAbits.ANSA2                // bit 2
#define ANSA4                   ANSELAbits.ANSA4                // bit 4
#define ANSA5                   ANSELAbits.ANSA5                // bit 5

#define ABDEN                   BAUD1CONbits.ABDEN              // bit 0
#define WUE                     BAUD1CONbits.WUE                // bit 1
#define BRG16                   BAUD1CONbits.BRG16              // bit 3
#define SCKP                    BAUD1CONbits.SCKP               // bit 4
#define RCIDL                   BAUD1CONbits.RCIDL              // bit 6
#define ABDOVF                  BAUD1CONbits.ABDOVF             // bit 7

#define BORRDY                  BORCONbits.BORRDY               // bit 0
#define SBOREN                  BORCONbits.SBOREN               // bit 7

#define BSR0                    BSRbits.BSR0                    // bit 0
#define BSR1                    BSRbits.BSR1                    // bit 1
#define BSR2                    BSRbits.BSR2                    // bit 2
#define BSR3                    BSRbits.BSR3                    // bit 3
#define BSR4                    BSRbits.BSR4                    // bit 4

#define CCDS0                   CCDCONbits.CCDS0                // bit 0
#define CCDS1                   CCDCONbits.CCDS1                // bit 1
#define CCDEN                   CCDCONbits.CCDEN                // bit 7

#define CCDNA0                  CCDNAbits.CCDNA0                // bit 0
#define CCDNA1                  CCDNAbits.CCDNA1                // bit 1
#define CCDNA2                  CCDNAbits.CCDNA2                // bit 2
#define CCDNA4                  CCDNAbits.CCDNA4                // bit 4
#define CCDNA5                  CCDNAbits.CCDNA5                // bit 5

#define CCDPA0                  CCDPAbits.CCDPA0                // bit 0
#define CCDPA1                  CCDPAbits.CCDPA1                // bit 1
#define CCDPA2                  CCDPAbits.CCDPA2                // bit 2
#define CCDPA4                  CCDPAbits.CCDPA4                // bit 4
#define CCDPA5                  CCDPAbits.CCDPA5                // bit 5

#define CCP1CTS0                CCP1CAPbits.CCP1CTS0            // bit 0
#define CCP1CTS1                CCP1CAPbits.CCP1CTS1            // bit 1
#define CCP1CTS2                CCP1CAPbits.CCP1CTS2            // bit 2

#define CCP1MODE0               CCP1CONbits.CCP1MODE0           // bit 0
#define CCP1MODE1               CCP1CONbits.CCP1MODE1           // bit 1
#define CCP1MODE2               CCP1CONbits.CCP1MODE2           // bit 2
#define CCP1MODE3               CCP1CONbits.CCP1MODE3           // bit 3
#define CCP1FMT                 CCP1CONbits.CCP1FMT             // bit 4
#define CCP1OUT                 CCP1CONbits.CCP1OUT             // bit 5
#define CCP1EN                  CCP1CONbits.CCP1EN              // bit 7

